system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// dimensions

frameWidth 0;
depth 0.1;

cubeWidth 1.5;
gapHeight 1;
entranceLength 3;
exitLength 5;


// coordiantes
x0 0;
x1 $entranceLength;
x2 3 + $cubeWidth;
x3 4.5 + $exitLength;
 
y0 0;
y1 $frameWidth;
y2 0 + $cubeWidth;
y3 1.5 + $gapHeight;
y4 2.5 + $frameWidth;

z0 0;
z1 $depth;

// mesh properties
deltaX 0.05;
deltaY 0.05;
deltaZ $depth;

scale   0.1;

vertices
(
    (0 0 0) // 0
    (3 0 0)
    (3 1.5 0)
    (4.5 1.5 0)
    (4.5 0 0)
    (9.5 0 0)
    (9.5 2.5 0)
    (4.5 2.5 0)
    (3 2.5 0)
    (0 2.5 0)

    (0 0 1) // 10
    (3 0 1)
    (3 1.5 1)
    (4.5 1.5 1)
    (4.5 0 1)
    (9.5 0 1)
    (9.5 2.5 1)
    (4.5 2.5 1)
    (3 2.5 1)
    (0 2.5 1)
);

blocks
(
    hex (0 1 8 9 10 11 18 19) (1 1 1) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 9 10 19)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (5 6 15 16)
        );
    }

    tunnel
    {
        type wall;
        faces
        (
            (0 1 10 11)
            (4 5 14 15)
            (6 9 16 19)
        );
    }    

    cube
    {
        type wall;
        faces
        (
            (1 2 11 12)
            (2 3 12 13)
            (3 4 13 14)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
